# Pandas入門01

In [2]:
import pandas as pd

## 問題1

In [7]:
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]],
                 columns=['col01', 'col02', 'col03'],
                 index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

## 問題2

In [15]:
df = pd.DataFrame([['Sato', 34, 'Tokyo'],
                  ['Suzuki', 46, 'Osaka'],
                  ['Yamada', 25, 'Fukuoka'],
                  ['Tanaka', 21, 'Sapporo']],
                  columns=['name', 'age', 'city'],
                  index=['1','2','3','4'])
df

     name  age     city
1    Sato   34    Tokyo
2  Suzuki   46    Osaka
3  Yamada   25  Fukuoka
4  Tanaka   21  Sapporo

## 問題3

- インデックスとカラムはリストで作成
- データはNUmpy配列で作成

In [3]:
import numpy as np

Numpy 高速にリストの計算するためのライブラリ

In [23]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),
                  columns=['col01', 'col02', 'col03'],
                  index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

## 問題4

In [32]:
import pandas as pd
import numpy as np

pd.DataFrame(np.array([['Sato', 34, 'Tokyo'],
                            ['Suzuki', 46, 'Osaka'],
                            ['Yamada', 25, 'Fukuoka'],
                            ['Tanaka', 21, 'Sapporo']]),
                            columns=['name', 'age', 'city'],
                            index=[1,2,3,4])

     name age     city
1    Sato  34    Tokyo
2  Suzuki  46    Osaka
3  Yamada  25  Fukuoka
4  Tanaka  21  Sapporo

## 問題５

完成イメージの通りに、データフレームからインデックスとカラムの値を取得してみましょう。
※データフレームのデータ生成にNumPyライブラリの関数を使用しているため、ライブラリのインポートを行うようにしてください。


完成イメージ
Index(['idx01', 'idx02', 'idx03'], dtype='object')
Index(['col01', 'col02', 'col03'], dtype='object')

In [35]:
# 使用データ
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),
                  columns=['col01','col02','col03'],
                  index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [41]:
df.index

Index(['idx01', 'idx02', 'idx03'], dtype='object')

In [42]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

## 問題６

下記のデータフレームから、完成イメージの通りに、インデックス、カラム、データの値をそれぞれ取得してみましょう。
※データフレームのデータ生成にNumPyライブラリの関数を使用しているため、ライブラリのインポートを行うようにしてください。

完成イメージ

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')
Index(['name', 'weight', 'height'], dtype='object')
array([['Sato', '75', '181.5'],
       ['Suzuki', '60', '165.3'],
       ['Takahashi', '70', '172.4'],
       ['Tanaka', '50', '158.2'],
       ['Ito', '65', '168.7']], dtype=object)

In [44]:
df = pd.DataFrame(np.array([['Sato',75,181.5],['Suzuki',60,165.3],['Takahashi',70,172.4],['Tanaka',50,158.2],['Ito',65,168.7]]),
                  columns=['name','weight','height'],
                  index=['A','B','C','D','E'])
df

        name weight height
A       Sato     75  181.5
B     Suzuki     60  165.3
C  Takahashi     70  172.4
D     Tanaka     50  158.2
E        Ito     65  168.7

In [45]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [46]:
df.columns

Index(['name', 'weight', 'height'], dtype='object')

In [49]:
df.values

array([['Sato', '75', '181.5'],
       ['Suzuki', '60', '165.3'],
       ['Takahashi', '70', '172.4'],
       ['Tanaka', '50', '158.2'],
       ['Ito', '65', '168.7']], dtype=object)

## 問題7

カラムとデータは辞書型で指定

In [53]:
df = pd.DataFrame({'col01':[1,2,3],
                'col02':[4,5,6],
                'col03':[7,8,9]},
                index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

 ## 問題8

カラムとデータは辞書型で指定し、変数d_dataに代入します。
インデックスはリスト型で指定し、変数l_indexに代入します。
それぞれの変数を使用して、完成イメージの通りにデータフレームを作成してみましょう

In [76]:
# df = pd.DataFrame({'height':[180,170,160,150],
#                 'weight':[80,70,60,50],
#                 'BMI':[20,19,18,16]},
#                 index=['Sato','Tanaka','Ito','Yamada'])


d_data = {'height':[180,170,160,150],
         'weight':[80,70,60,50],
         'BMI':[20,19,18,16]}
I_index = ['Sato','Tanaka','Ito','Yamada']
df = pd.DataFrame(data=d_data,index=I_index)

df

        height  weight  BMI
Sato       180      80   20
Tanaka     170      70   19
Ito        160      60   18
Yamada     150      50   16

## 問題9

カラム名変更

In [90]:
df = pd.DataFrame([[1, 2, 3],[4, 5, 6],[7, 8, 9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [91]:
df = df.rename(columns={0: 'col01', 1: 'col02', 2: 'col03'},
               index={0: 'idx01', 1: 'idx02', 2: 'idx03'})
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

## 問題10

下記データフレームのカラムを「name, age, state」、インデックスを「No.1, No.2, No.3, No.4」に変更してみましょう。

In [94]:
df = pd.DataFrame([['John','29','NY'],['Mike','32','NJ'],['Chloe','35','MA'], ['Emma', '28','WA']],columns=['col01', 'col02', 'col03'],index=['idx01','idx02','idx03','idx04'])
df

       col01 col02 col03
idx01   John    29    NY
idx02   Mike    32    NJ
idx03  Chloe    35    MA
idx04   Emma    28    WA

In [97]:
df = df.rename(columns={'col01':'name', 'col02':'age', 'col03':'state'},
               index={'name': 'No.01', 'age': 'No.02', 'state': 'No.03'})
df

        name age state
idx01   John  29    NY
idx02   Mike  32    NJ
idx03  Chloe  35    MA
idx04   Emma  28    WA

## 問題11
下記データフレームのカラムの値'col04'を'x'に変更して、完成イメージの通りにデータフレームを表示させてみましょう

In [99]:
df = pd.DataFrame([[1, 2, 3],[4, 5, 6], [7, 8, 9]],
                  columns=['col04','col05','col06'],
                  index=['idx01','idx02','idx03'])
df

       col04  col05  col06
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [100]:
df = df.rename(columns={'col04':'x'})
df

       x  col05  col06
idx01  1      2      3
idx02  4      5      6
idx03  7      8      9

## 問題12

下記データフレームのインデックスの値'Sato'を'A'に変更して、完成イメージの通りにデータフレームを表示させてみましょう。

In [103]:
df = pd.DataFrame([[30, 'Python', 80, 'False'],[35, 'Ruby', 90, 'True'],[40, 'Java', 100, 'True']],
                  index=['Sato', 'Yamada', 'Suzuki'],
                  columns=['Age','Language','Score','Result'])
df

        Age Language  Score Result
Sato     30   Python     80  False
Yamada   35     Ruby     90   True
Suzuki   40     Java    100   True

In [104]:
df = df.rename(index={'Sato':'A'})
df

        Age Language  Score Result
A        30   Python     80  False
Yamada   35     Ruby     90   True
Suzuki   40     Java    100   True

## 問題13
完成イメージの通りに、データフレームを変更してみましょう。
ポイント

・インデックスの全ての文字を、大文字に変更します。
・カラムの頭文字を、大文字に変更します。

In [108]:
df = pd.DataFrame([[30, 'Python', 80, 'False'], [35, 'Ruby', 90, 'True'],[40, 'Java', 100, 'True']],
                  index=['Sato', 'Yamada', 'Suzuki'],
                  columns=['age','language','score','result'])
df

        age language  score result
Sato     30   Python     80  False
Yamada   35     Ruby     90   True
Suzuki   40     Java    100   True

In [119]:
# df = df.rename(columns={'age':'Age', 'language':'Language', 'score':'Score', 'result':'Result'},
#                index={'Sato': 'SATO', 'Yamada': 'YAMADA', 'Suzuki': 'SUZUKI'})

# 動的に記述する際は以下
df.rename(index=str.upper,columns=str.title)

# pythonの組み込み関数 str は、様々な文字列操作を行うための関数です

        Age Language  Score Result
SATO     30   Python     80  False
YAMADA   35     Ruby     90   True
SUZUKI   40     Java    100   True

## 問題14

完成イメージの通りに、下記データフレームから'x'列をシリーズで取得してみましょう。
完成イメージ
idx01    1
idx02    4
idx03    7
Name: x, dtype: int64

In [121]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]],
                  columns=['x','y','z'],
                  index=['idx01','idx02','idx03'])
df

       x  y  z
idx01  1  2  3
idx02  4  5  6
idx03  7  8  9

In [122]:
df['x']

idx01    1
idx02    4
idx03    7
Name: x, dtype: int64

## 問題15

下記データフレームから'BMI'列をデータフレームで取得してみましょう。

In [124]:
df = pd.DataFrame([[180,'80','20'],[170,'70','19'],[160,'60','18'], [150, '50','16']],
                  columns=['height', 'weight', 'BMI'],
                  index=['Sato', 'Tanaka', 'Ito','Yamada'])
df

        height weight BMI
Sato       180     80  20
Tanaka     170     70  19
Ito        160     60  18
Yamada     150     50  16

In [126]:
df[['BMI']]

       BMI
Sato    20
Tanaka  19
Ito     18
Yamada  16

## 問題16

完成イメージの通りに、データフレームから'col2'列と'col5'列の要素を取得してみましょう。
※データフレームのデータ生成にNumPyライブラリの関数を使用しているため、ライブラリのインポートを行うようにしてください。

In [128]:
import numpy as np

df=pd.DataFrame(np.arange(25).reshape(5,5),
                columns=['col1', 'col2', 'col3', 'col4', 'col5'],
                index=['idx1', 'idx2', 'idx3', 'idx4', 'idx5'])
df

      col1  col2  col3  col4  col5
idx1     0     1     2     3     4
idx2     5     6     7     8     9
idx3    10    11    12    13    14
idx4    15    16    17    18    19
idx5    20    21    22    23    24

In [139]:
df.loc[:, ['col2', 'col5']]

      col2  col5
idx1     1     4
idx2     6     9
idx3    11    14
idx4    16    19
idx5    21    24

## 問題17
locプロパティを使用して、完成イメージの通りに、下記データフレームから'idx01'行をシリーズで取得してみましょう。


x    1
y    2
z    3
Name: idx01, dtype: int64

In [141]:
df = pd.DataFrame([[1, 2, 3],[4, 5, 6],[7, 8, 9]],
                  columns=['x','y','z'],
                  index=['idx01','idx02','idx03'])
df

       x  y  z
idx01  1  2  3
idx02  4  5  6
idx03  7  8  9

In [143]:
df.loc['idx01']

x    1
y    2
z    3
Name: idx01, dtype: int64

## 問題18
locプロパティを使用して、完成イメージの通りに、下記データフレームから'Tanaka'行をデータフレームで取得してみましょう。

In [144]:
df = pd.DataFrame([[180,'80','20'],[170,'70','19'],[160,'60','18'], [150, '50','16']],
                  columns=['height', 'weight', 'BMI'],
                  index=['Sato', 'Tanaka', 'Ito','Yamada'])
df

        height weight BMI
Sato       180     80  20
Tanaka     170     70  19
Ito        160     60  18
Yamada     150     50  16

In [145]:
df.loc[['Tanaka']]

        height weight BMI
Tanaka     170     70  19

## 問題19
locプロパティを使用して、完成イメージの通りに、下記データフレームから要素の2を取得してみましょう。

In [148]:
df = pd.DataFrame([[1, 2, 3],[4, 5, 6], [7, 8, 9]],
                  columns=['col01','col02','col03'],
                  index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [154]:
# df.iloc[0,1] 
df.loc['idx01', 'col02']

2

## 問題20
locプロパティを使用して、完成イメージの通りに、下記データフレームから要素の28と22をシリーズで取得してみましょう。

B    28
D    22
Name: No.3, dtype: int64

In [158]:
# 使用データ
df = pd.DataFrame({'No.1':[10, 15, 12, 48, 32],
                   'No.2':[29, 1, 43, 18, 25],
                   'No.3':[38, 28, 16, 22, 49]},
                  index=['A', 'B', 'C', 'D', 'E'])
df

   No.1  No.2  No.3
A    10    29    38
B    15     1    28
C    12    43    16
D    48    18    22
E    32    25    49

In [164]:
df.loc[['B', 'D'], 'No.3']

B    28
D    22
Name: No.3, dtype: int64

## 問題21
locプロパティを使用して、完成イメージの通りに、下記データフレームから'x'列をシリーズで取得してみましょう。

完成イメージ


idx01    1
idx02    4
idx03    7
Name: x, dtype: int64

In [5]:
# 使用データフレーム
df = pd.DataFrame([[1, 2, 3],[4, 5, 6],[7, 8, 9]],
                  columns=['x','y','z'],
                  index=['idx01','idx02','idx03'])
df

       x  y  z
idx01  1  2  3
idx02  4  5  6
idx03  7  8  9

In [9]:
df.loc[:,'x']

idx01    1
idx02    4
idx03    7
Name: x, dtype: int64

## 問題22
locプロパティを使用して、下記データフレームから'C'行と'E'行をデータフレームで取得してみましょう。

In [12]:
# 使用データフレーム
df = pd.DataFrame({'No.1': [10, 15, 12, 48, 32],
                   'No.2': [29, 1, 43, 18, 25],
                   'No.3': [38, 28, 16, 22, 49]},
                    index=['A', 'B', 'C', 'D', 'E'])
df

   No.1  No.2  No.3
A    10    29    38
B    15     1    28
C    12    43    16
D    48    18    22
E    32    25    49

In [23]:
df.loc[['C','E'],:] #スライスにおけるコロンは、全てのデータという意味

   No.1  No.2  No.3
C    12    43    16
E    32    25    49

## 問題23
locプロパティを使用して、下記データフレームの要素の6を100に変更してみましょう。

In [33]:
df = pd.DataFrame({'col01':[1, 2, 3],
                   'col02':[4, 5, 6], 
                   'col03':[7, 8, 9]},
                  index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [34]:
# 特定の要素を変更する
df.loc['idx03', 'col02'] = 100
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3    100      9

## 問題24
locプロパティとスライスを使用して、完成イメージの通りに、下記データフレームの'col3'列の要素をすべて'Tokyo', 'NewYork', 'London', 'Seoul'、'Paris'に変更してみましょう。

In [36]:
# 使用データフレーム
df = pd.DataFrame({'col1': ['A', 'C', 'A', 'C', 'A'],
                   'col2': ['a', 'a', 'c', 'c', 'a'],
                   'col3': [600, 800, 100, 120, 180]})
df

  col1 col2  col3
0    A    a   600
1    C    a   800
2    A    c   100
3    C    c   120
4    A    a   180

In [52]:
df.loc[:, ['col3']] = ['Tokyo', 'NewYork','London', 'Seoul','Paris']
df

  col1 col2     col3
0    A    a    Tokyo
1    C    a  NewYork
2    A    c   London
3    C    c    Seoul
4    A    a    Paris

## 問題25
locプロパティを使用して、完成イメージの通りに、下記データフレームの要素の22,23,34を、それぞれ'A','B','C'に変更してみましょう。
※データフレームのデータ生成にNumPyライブラリの関数を使用しているため、ライブラリのインポートを行うようにしてください。

In [54]:
df = pd.DataFrame(np.arange(25).reshape(5,5),
                  columns=['col1', 'col2', 'col3', 'col4', 'col5'],
                  index=['idx1', 'idx2', 'idx3', 'idx4', 'idx5'])
df

      col1  col2  col3  col4  col5
idx1     0     1     2     3     4
idx2     5     6     7     8     9
idx3    10    11    12    13    14
idx4    15    16    17    18    19
idx5    20    21    22    23    24

In [67]:
df.loc[['idx5'], ['col3', 'col4','col5']] = ['A', 'B', 'C']
df

# 以下でも可
# df.loc['idx5', 'col3':'col5']=['A', 'B', 'C']

      col1  col2 col3 col4 col5
idx1     0     1    2    3    4
idx2     5     6    7    8    9
idx3    10    11   12   13   14
idx4    15    16   17   18   19
idx5    20    21    A    B    C

## 問題26
locプロパティを使用して、完成イメージの通りに、下記データフレームの'col2'列と'col3'列のデータを取得してみましょう。

In [69]:
# 使用データフレーム
df = pd.DataFrame({'col01':[1, 2, 3],
                   'col02':[4, 5, 6],
                   'col03':[7, 8, 9]},
                  index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [78]:
df.loc[:,'col02':'col03']

# こっちも同じ
# df.loc[:, ['col02','col03']]

       col02  col03
idx01      4      7
idx02      5      8
idx03      6      9

## 問題27
locプロパティを使用して、完成イメージの通りに、下記データフレームの'B'行から'D'行までにおける、'No.1'列と'No.2'列のデータを取得してみましょう。

In [81]:
# 使用データフレーム
df = pd.DataFrame({'No.1': [10, 15, 12, 48, 32],
                   'No.2': [29, 1, 43, 18, 25],
                   'No.3': [38, 28, 16, 22, 49]},
                  index=['A', 'B', 'C', 'D', 'E'])
df

   No.1  No.2  No.3
A    10    29    38
B    15     1    28
C    12    43    16
D    48    18    22
E    32    25    49

In [84]:
df.loc['B':'D','No.1':'No.2']

   No.1  No.2
B    15     1
C    12    43
D    48    18

## 問題28
ilocプロパティを使用して、完成イメージの通りに、下記データフレームの2列目から3列目までのデータを取得してみましょう。
※データフレームのデータ生成にNumPyライブラリの関数を使用しているため、ライブラリのインポートを行うようにしてください。

In [86]:
# 使用データフレーム
df=pd.DataFrame(np.arange(25).reshape(5,5),
                columns=['col1', 'col2', 'col3', 'col4', 'col5'],
                index=['idx1', 'idx2', 'idx3', 'idx4', 'idx5'])
df

      col1  col2  col3  col4  col5
idx1     0     1     2     3     4
idx2     5     6     7     8     9
idx3    10    11    12    13    14
idx4    15    16    17    18    19
idx5    20    21    22    23    24

In [94]:
df.loc[:,'col2':'col3']

# こちらでも可
# df.iloc[:,1:3]

      col2  col3
idx1     1     2
idx2     6     7
idx3    11    12
idx4    16    17
idx5    21    22

## 問題29
ilocプロパティとスライスを使用して、下記データフレームの2行目から4行目における、2列目までのデータを取得してみましょう。

In [97]:
# 使用データフレーム
df=pd.DataFrame(np.arange(25).reshape(5,5),
                columns=['col1', 'col2', 'col3', 'col4', 'col5'],
                index=['idx1', 'idx2', 'idx3', 'idx4', 'idx5'])
df

      col1  col2  col3  col4  col5
idx1     0     1     2     3     4
idx2     5     6     7     8     9
idx3    10    11    12    13    14
idx4    15    16    17    18    19
idx5    20    21    22    23    24

In [100]:
df.iloc[1:4, :2]

      col1  col2
idx2     5     6
idx3    10    11
idx4    15    16

## 問題30
完成イメージの通りに、下記データフレームから'idx03'の行番号を取得してみましょう。

完成イメージ

2

In [102]:
df = pd.DataFrame({'col01':[1, 2, 3],'col02':[4, 5, 6],'col03':[7, 8, 9]},
                  index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [103]:
df.index.get_loc('idx03')

2

## 問題31
完成イメージの通りに、下記データフレームから'No.2'の列番号を取得してみましょう。

完成イメージ

1

In [105]:
df = pd.DataFrame({'No.1': [10, 15, 12, 48, 32],
                   'No.2': [29, 1, 43, 18, 25],
                   'No.3': [38, 28, 16, 22, 49]},
                  index=['A', 'B', 'C', 'D', 'E'])
df

   No.1  No.2  No.3
A    10    29    38
B    15     1    28
C    12    43    16
D    48    18    22
E    32    25    49

In [109]:
df.columns.get_loc('No.2')

1

## 問題32
get_locメソッドとilocプロパティを使用して、下記データフレームのインデックスが'B'、カラムが'No.2'の要素を文字列'data'に変更してみましょう

In [135]:
# 使用データフレーム
df = pd.DataFrame({'No.1': [10, 15, 12, 48, 32],
                   'No.2': [29, 1, 43, 18, 25],
                   'No.3': [38, 28, 16, 22, 49]},
                  index=['A', 'B', 'C', 'D', 'E'])
df

   No.1  No.2  No.3
A    10    29    38
B    15     1    28
C    12    43    16
D    48    18    22
E    32    25    49

In [138]:
df.iloc[df.index.get_loc('B'), df.columns.get_loc('No.2')] = 'data'
df

   No.1  No.2  No.3
A    10    29    38
B    15  data    28
C    12    43    16
D    48    18    22
E    32    25    49

## 問題33
完成イメージの通りに、下記データフレームの列ごとのデータ型を表示させてみましょう。


Age          int64
Language    object
Score        int64
Result      object
dtype: object

In [139]:
# 使用データ
df = pd.DataFrame([[30, 'Python', 80, 'False'], 
                   [35, 'Ruby', 90, 'True'], 
                   [40, 'Java', 100, 'True']], 
                  index=['Sato', 'Yamada', 'Suzuki'], 
                  columns=['Age','Language','Score','Result'])
df

        Age Language  Score Result
Sato     30   Python     80  False
Yamada   35     Ruby     90   True
Suzuki   40     Java    100   True

In [140]:
df.dtypes

Age          int64
Language    object
Score        int64
Result      object
dtype: object

## 問題34

完成イメージの通りに、下記データフレームから'Age'列のみのデータ型を表示させてみましょう。

完成イメージ


dtype('int64')

In [143]:
# 使用デーフレーム
df = pd.DataFrame([[30, 'Python', 80, 'False'], 
                   [35, 'Ruby', 90, 'True'], 
                   [40, 'Java', 100, 'True']], 
                  index=['Sato', 'Yamada', 'Suzuki'], 
                  columns=['Age','Language','Score','Result'])
df

        Age Language  Score Result
Sato     30   Python     80  False
Yamada   35     Ruby     90   True
Suzuki   40     Java    100   True

In [147]:
df.dtypes['Age']

# こちらでもよい
# df['Age'].dtype

dtype('int64')

## 問題35
完成イメージの通りに、下記データフレームの行数と列数をタプル型で取得してみましょう。

完成イメージ

(3, 3)

In [150]:
# 使用データ
df = pd.DataFrame({'col01':[1, 2, 3],
                   'col02':[4, 5, 6],
                   'col03':[7, 8, 9]},
                  index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [151]:
df.shape

(3, 3)

## 問題36

下記データフレームの行数のみを取得してみましょう。
※データフレームのデータ生成にNumPyライブラリの関数を使用しているため、ライブラリのインポートを行うようにしてください。

完成イメージ

5

In [155]:
import numpy as np

df=pd.DataFrame(np.arange(25).reshape(5,5),
                columns=['col1', 'col2', 'col3', 'col4', 'col5'],
                index=['idx1', 'idx2', 'idx3', 'idx4', 'idx5'])
df

      col1  col2  col3  col4  col5
idx1     0     1     2     3     4
idx2     5     6     7     8     9
idx3    10    11    12    13    14
idx4    15    16    17    18    19
idx5    20    21    22    23    24

In [156]:
len(df)

5

## 問題37
下記データフレームの行と列を入れ替えてみましょう。

In [158]:
# 使用データフレーム
df = pd.DataFrame({'col01':[1, 2, 3],
                   'col02':[4, 5, 6],
                   'col03':[7, 8, 9]},
                  index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [159]:
df.transpose()

       idx01  idx02  idx03
col01      1      2      3
col02      4      5      6
col03      7      8      9